working_with_me.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-31 Sat 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Zlef" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgefeb662">1. What brings me energy at work?</a></li>
<li><a href="#org0d56a7c">2. What drains me at work?</a></li>
<li><a href="#orgcc8bd3e">3. How I collaborate?</a></li>
<li><a href="#orgbabe72b">4. Preferred communication channels?</a></li>
<li><a href="#org533d07d">5. After Hours communication</a></li>
<li><a href="#orgfca9bf0">6. A typical day for me looks like&#x2026;</a></li>
<li><a href="#org2530065">7. My expectations of you</a></li>
<li><a href="#org8151de1">8. Challenge me when</a></li>
<li><a href="#org4c57c37">9. How I appreciate feedback</a></li>
<li><a href="#org322096c">10. My development</a></li>
<li><a href="#orgf31665f">11. Interests:</a>
<ul>
<li><a href="#org7d7350e">11.1. Some fun facts about me</a></li>
<li><a href="#orga5f9634">11.2. My passions outside of work</a></li>
<li><a href="#org25e66d8">11.3. Some pet peeves</a></li>
<li><a href="#org7e54e88">11.4. My superpowers</a></li>
</ul>
</li>
<li><a href="#orgc685d8e">12. My favorite quote(s):</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgefeb662" class="outline-2">
<h2 id="orgefeb662"><span class="section-number-2">1.</span> What brings me energy at work?</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>A really tricky problem. Grasping the edge of a solution to a complicated problem.</li>
<li>Using the tools I love. Using tools I'm good at and moving at the speed of thought.</li>
</ul>
</div>
</div>

<div id="outline-container-org0d56a7c" class="outline-2">
<h2 id="org0d56a7c"><span class="section-number-2">2.</span> What drains me at work?</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Using bad tools. There's nothing I hate more than using tools built by people who do not care for me.</li>
<li>Not being able to help. I want to mentor and help people. I like talking about my favorite languages and tools. Other folks not being interested in learning new things makes me frustrated.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcc8bd3e" class="outline-2">
<h2 id="orgcc8bd3e"><span class="section-number-2">3.</span> How I collaborate?</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>We pair over a shared screen and push one another to greater levels of depth</li>
<li>We are both focused. We take breaks as opposed to working unfocused.</li>
<li>We take turns changing who drives. I have a habit of driving too much, which is not good.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbabe72b" class="outline-2">
<h2 id="orgbabe72b"><span class="section-number-2">4.</span> Preferred communication channels?</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>On a video call with a shared whiteboard/buffer between us.</li>
</ul>
</div>
</div>

<div id="outline-container-org533d07d" class="outline-2">
<h2 id="org533d07d"><span class="section-number-2">5.</span> After Hours communication</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Text me, otherwise I won't see it.</li>
<li>Honestly, please don't.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfca9bf0" class="outline-2">
<h2 id="orgfca9bf0"><span class="section-number-2">6.</span> A typical day for me looks like&#x2026;</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>I wake up at 6 and make coffee. I see Sarah off to work. I finish whatever chapter I fell asleep reading.</li>
<li>I study Anki and take Samuel on a walk. I get to work around 9 with Teams off. I do work until 11AM and then turn Teams on.</li>
<li>I work in 90 minute chunks. Every 90 minutes I walk away from the computer for ~ 20 minutes. I come back, check Teams, and then turn it off and get back to work.</li>
<li>I work until ~ 5 PM and then shut work off.</li>
<li>I try to write some open open source and catch up on RSS.</li>
</ul>
</div>
</div>

<div id="outline-container-org2530065" class="outline-2">
<h2 id="org2530065"><span class="section-number-2">7.</span> My expectations of you</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>I want to hear about what you've learned lately</li>
<li>I want you to ask questions when learning something new</li>
<li>I want you to <b>work on yourself</b>. I don't want to hear you complain about a thing you're not actively trying to fix.</li>
<li>I want you to have empathy. I don't want to hear you complain about a person when a system is to blame.</li>
<li>I want you to meet folks where they're at. Most people are effectively the same, just less lucky versions, of you and I. Interpret people in the best possible light.</li>
</ul>
</div>
</div>

<div id="outline-container-org8151de1" class="outline-2">
<h2 id="org8151de1"><span class="section-number-2">8.</span> Challenge me when</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>I've been mean or inappropriate. I've talked over someone.</li>
<li><b>I've made somebody feel stupid or inadequate</b></li>
<li>I've stumbled overmyself and not presented myself clearly.</li>
</ul>
</div>
</div>

<div id="outline-container-org4c57c37" class="outline-2">
<h2 id="org4c57c37"><span class="section-number-2">9.</span> How I appreciate feedback</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Directly and without fluff. "In the last meeting you seemed unprepared."</li>
<li>Not over text. A lot of nuance is lost in text. I want to hear and see you.</li>
</ul>
</div>
</div>

<div id="outline-container-org322096c" class="outline-2">
<h2 id="org322096c"><span class="section-number-2">10.</span> My development</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>I'm trying to let people fail more. Everything I like about myself has come from making a jackass of myself. Others should be able to do the same thing without being shunned.</li>
<li>I'm trying to let other people be less optimal. Folks need to <b>feel</b>, not just learn, how to do the thing. Teach a man to fish and all that.</li>
<li>I am bad at small talk. I'd like to be able to talk to a stranger.</li>
<li>Inferiority/imposter syndrome.</li>
<li>Grammar.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf31665f" class="outline-2">
<h2 id="orgf31665f"><span class="section-number-2">11.</span> Interests:</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org7d7350e" class="outline-3">
<h3 id="org7d7350e"><span class="section-number-3">11.1.</span> Some fun facts about me</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>My ham radio license is KJ5CGZ</li>
<li>I drive a 1995 geotracker</li>
<li>Sarah makes fun of me for not being able to use a computer &#x2013; I basically can't use a computer without a split keyboard</li>
</ul>
</div>
</div>

<div id="outline-container-orga5f9634" class="outline-3">
<h3 id="orga5f9634"><span class="section-number-3">11.2.</span> My passions outside of work</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>Books</li>
<li>Recreational coding</li>
<li><b>Backpacking</b> and camping</li>
</ul>
</div>
</div>

<div id="outline-container-org25e66d8" class="outline-3">
<h3 id="org25e66d8"><span class="section-number-3">11.3.</span> Some pet peeves</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>Inflexibility</li>
<li>Being judgemental to people</li>
<li>Folks wanting control/micromanaging</li>
</ul>
</div>
</div>

<div id="outline-container-org7e54e88" class="outline-3">
<h3 id="org7e54e88"><span class="section-number-3">11.4.</span> My superpowers</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>Anki</li>
<li>Emacs</li>
<li>Patience</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc685d8e" class="outline-2">
<h2 id="orgc685d8e"><span class="section-number-2">12.</span> My favorite quote(s):</h2>
<div class="outline-text-2" id="text-12">
<p>
Syntactic sugar causes cancer of the semicolon &#x2013; Alan Perlis
</p>

<p>
"The truth about the world, he said, is that anything is possible. Had you not seen it all from birth and thereby bled it of its strangeness it would appear to you for what it is, a hat trick in a medicine show, a fevered dream, a trance bepopulate with chimeras having neither analogue nor precedent, an itinerant carnival, a migratory tentshow whose ultimate destination after many a pitch in many a mudded field is unspeakable and calamitous beyond reckoning.
</p>

<p>
The universe is no narrow thing and the order within it is not constrained by any latitude in its conception to repeat what exists in one part in any other part. Even in this world more things exist without our knowledge than with it and the order in creation which you see is that which you have put there, like a string in a maze, so that you shall not lose your way. For existence has its own order and that no man's mind can compass, that mind itself being but a fact among others."
 &#x2013; Cormac McCarthy
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zlef</p>
<p class="date">Created: 2024-08-31 Sat 23:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
